packages/correos/correos-0.0.6.tar.gz/correos-0.0.6/correos/template/picking_send.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns="http://www.correos.es/iris6/services/preregistroetiquetas"
    xmlns:py="http://genshi.edgewall.org/">
    <soapenv:Header/>
    <soapenv:Body>
        <PreregistroEnvio>
            <FechaOperacion>${now}</FechaOperacion>
            <CodEtiquetador>${code}</CodEtiquetador>
            <Care>${Care}</Care>
            <TotalBultos>${TotalBultos}</TotalBultos>
            <ModDevEtiqueta>${ModDevEtiqueta}</ModDevEtiqueta>
            <Remitente>
                <Identificacion>
                    <Nombre>${RemitenteNombre}</Nombre>
                    <Apellido1>${RemitenteApellido1}</Apellido1>
                    <Apellido2>${RemitenteApellido2}</Apellido2>
                    <Nif>${RemitenteNif}</Nif>
                    <Empresa>${RemitenteEmpresa}</Empresa>
                    <PersonaContacto>${RemitentePersonaContacto}</PersonaContacto>
                </Identificacion>
                <DatosDireccion>
                    <Direccion>${RemitenteDireccion}</Direccion>
                    <Numero>${RemitenteNumero}</Numero>
                    <Piso>${RemitentePiso}</Piso>
                    <Puerta>${RemitentePuerta}</Puerta>
                    <Localidad>${RemitenteLocalidad}</Localidad>
                    <Provincia>${RemitenteProvincia}</Provincia>
                </DatosDireccion>
                <CP>${RemitenteCP}</CP>
                <Telefonocontacto>${RemitenteTelefonocontacto.replace(' ', '')}</Telefonocontacto>
                <Email>${RemitenteEmail}</Email>
                <DatosSMS py:if="RemitenteNumeroSMS">
                    <NumeroSMS>${RemitenteNumeroSMS.replace(' ', '')}</NumeroSMS>
                    <Idioma>${RemitenteIdioma}</Idioma>
                </DatosSMS>
            </Remitente>
            <Destinatario>
                <Identificacion>
                    <Nombre>${DestinatarioNombre}</Nombre>
                    <Apellido1>${DestinatarioApellido1}</Apellido1>
                    <Apellido2>${DestinatarioApellido2}</Apellido2>
                </Identificacion>
                <DatosDireccion>
                    <Direccion>${DestinatarioDireccion}</Direccion>
                    <Numero>${DestinatarioNumero}</Numero>
                    <Piso>${DestinatarioPiso}</Piso>
                    <Puerta>${DestinatarioPuerta}</Puerta>
                    <Localidad>${DestinatarioLocalidad}</Localidad>
                    <Provincia>${DestinatarioProvincia}</Provincia>
                </DatosDireccion>
                <CP>${DestinatarioCP}</CP>
                <ZIP>${DestinatarioZIP}</ZIP>
                <Pais>${DestinatarioPais}</Pais>
                <Telefonocontacto>${DestinatarioTelefonocontacto.replace(' ', '')}</Telefonocontacto>
                <Email>${DestinatarioEmail}</Email>
                <DatosSMS py:if="DestinatarioNumeroSMS">
                    <NumeroSMS>${DestinatarioNumeroSMS}</NumeroSMS>
                    <Idioma>${DestinatarioIdioma}</Idioma>
                </DatosSMS>
            </Destinatario>
            <Envio>
                <CodProducto>${CodProducto}</CodProducto>
                <ReferenciaCliente>${ReferenciaCliente}</ReferenciaCliente>
                <ReferenciaCliente2>${ReferenciaCliente2}</ReferenciaCliente2>
                <TipoFranqueo>${TipoFranqueo}</TipoFranqueo>
                <ModalidadEntrega>${ModalidadEntrega}</ModalidadEntrega>
                <OficinaElegida py:if="OficinaElegida">${OficinaElegida}</OficinaElegida>
                <Pesos>
                    <Peso>
                        <TipoPeso>${TipoPeso}</TipoPeso>
                        <Valor>${Peso}</Valor>
                    </Peso>
                </Pesos>
                <Largo py:if="Largo">${Largo}</Largo>
                <Alto py:if="Alto">${Alto}</Alto>
                <Ancho py:if="Ancho">${Ancho}</Ancho>
                <ValoresAnadidos>
                    <ImporteSeguro py:if="ImporteSeguro">${ImporteSeguro}</ImporteSeguro>
                    <Reembolso py:if="Reembolso">
                        <TipoReembolso>${TipoReembolso}</TipoReembolso>
                        <Importe>${Importe}</Importe>
                        <NumeroCuenta>${NumeroCuenta}</NumeroCuenta>
                    </Reembolso>
                    <EntregaExclusivaDestinatario>${EntregaExclusivaDestinatario}</EntregaExclusivaDestinatario>
                </ValoresAnadidos>
                <Observaciones1>${Observaciones1}</Observaciones1>
                <Observaciones2>${Observaciones2}</Observaciones2>
                <InstruccionesDevolucion>${InstruccionesDevolucion}</InstruccionesDevolucion>
                <Aduana py:if="Aduana">
                    <TipoEnvio>${AduanaTipoEnvio}</TipoEnvio>
                    <EnvioComercial>${AduanaEnvioComercial}</EnvioComercial>
                    <FacturaSuperiora500>${AduanaFacturaSuperiora500}</FacturaSuperiora500>
                    <DUAConCorreos>${AduanaDUAConCorreos}</DUAConCorreos>
                    <DescAduanera>
                       <DATOSADUANA>
                          <Cantidad>${AduanaCantidad}</Cantidad>
                          <Descripcion>${AduanaDescripcion}</Descripcion>
                          <Pesoneto>${AduanaPesoneto}</Pesoneto>
                          <Valorneto>${AduanaValorneto}</Valorneto>
                       </DATOSADUANA>
                    </DescAduanera>
                </Aduana>
            </Envio>
        </PreregistroEnvio>
    </soapenv:Body>
</soapenv:Envelope>
